



Open Shortest Path First IGP                                    S. Hegde
Internet-Draft                                    Juniper Networks, Inc.
Intended status: Standards Track                               P. Sarkar
Expires: August 4, 2018                                     Arrcus, Inc.
                                                              H. Gredler
                                                              Individual
                                                              M. Nanduri
                                                        ebay Corporation
                                                                L. Jalil
                                                                 Verizon
                                                        January 31, 2018


                      OSPF Graceful Link shutdown
                    draft-ietf-ospf-link-overload-15

Abstract

   When a link is being prepared to be taken out of service, the traffic
   needs to be diverted from both ends of the link.  Increasing the
   metric to the highest value on one side of the link is not sufficient
   to divert the traffic flowing in the other direction.

   It is useful for the routers in an OSPFv2 or OSPFv3 routing domain to
   be able to advertise a link as being in a graceful-shutdown state to
   indicate impending maintenance activity on the link.  This
   information can be used by the network devices to re-route the
   traffic effectively.

   This document describes the protocol extensions to disseminate
   graceful-link-shutdown information in OSPFv2 and OSPFv3.

Requirements Language

   The key words "MUST", "MUST NOT", "REQUIRED", "SHALL", "SHALL NOT",
   "SHOULD", "SHOULD NOT", "RECOMMENDED", "MAY", and "OPTIONAL" in this
   document are to be interpreted as described in RFC 2119 [RFC2119].

Status of This Memo

   This Internet-Draft is submitted in full conformance with the
   provisions of BCP 78 and BCP 79.

   Internet-Drafts are working documents of the Internet Engineering
   Task Force (IETF).  Note that other groups may also distribute
   working documents as Internet-Drafts.  The list of current Internet-
   Drafts is at https://datatracker.ietf.org/drafts/current/.




Hegde, et al.            Expires August 4, 2018                 [Page 1]

Internet-Draft         OSPF graceful link shutdown          January 2018


   Internet-Drafts are draft documents valid for a maximum of six months
   and may be updated, replaced, or obsoleted by other documents at any
   time.  It is inappropriate to use Internet-Drafts as reference
   material or to cite them other than as "work in progress."

   This Internet-Draft will expire on August 4, 2018.

Copyright Notice

   Copyright (c) 2018 IETF Trust and the persons identified as the
   document authors.  All rights reserved.

   This document is subject to BCP 78 and the IETF Trust's Legal
   Provisions Relating to IETF Documents
   (https://trustee.ietf.org/license-info) in effect on the date of
   publication of this document.  Please review these documents
   carefully, as they describe your rights and restrictions with respect
   to this document.  Code Components extracted from this document must
   include Simplified BSD License text as described in Section 4.e of
   the Trust Legal Provisions and are provided without warranty as
   described in the Simplified BSD License.

Table of Contents

   1.  Introduction  . . . . . . . . . . . . . . . . . . . . . . . .   3
   2.  Motivation  . . . . . . . . . . . . . . . . . . . . . . . . .   4
   3.  Flooding Scope  . . . . . . . . . . . . . . . . . . . . . . .   4
   4.  Protocol Extensions . . . . . . . . . . . . . . . . . . . . .   4
     4.1.  OSPFv2 graceful-link-shutdown sub-TLV . . . . . . . . . .   4
     4.2.  Remote IPv4 Address Sub-TLV . . . . . . . . . . . . . . .   5
     4.3.  Local/Remote Interface ID Sub-TLV . . . . . . . . . . . .   6
     4.4.  OSPFv3 Graceful-Link-Shutdown sub-TLV . . . . . . . . . .   6
     4.5.  BGP-LS Graceful-Link-Shutdown TLV . . . . . . . . . . . .   7
     4.6.  Distinguishing parallel links . . . . . . . . . . . . . .   7
   5.  Elements of procedure . . . . . . . . . . . . . . . . . . . .   8
     5.1.  Point-to-point links  . . . . . . . . . . . . . . . . . .   9
     5.2.  Broadcast/NBMA links  . . . . . . . . . . . . . . . . . .  10
     5.3.  Point-to-multipoint links . . . . . . . . . . . . . . . .  10
     5.4.  Unnumbered interfaces . . . . . . . . . . . . . . . . . .  10
     5.5.  Hybrid Broadcast and P2MP interfaces  . . . . . . . . . .  11
   6.  Backward compatibility  . . . . . . . . . . . . . . . . . . .  11
   7.  Applications  . . . . . . . . . . . . . . . . . . . . . . . .  11
     7.1.  Pseudowire Services . . . . . . . . . . . . . . . . . . .  11
     7.2.  Controller based Traffic Engineering Deployments  . . . .  12
     7.3.  L3VPN Services and sham-links . . . . . . . . . . . . . .  13
     7.4.  Hub and spoke deployment  . . . . . . . . . . . . . . . .  14
   8.  Security Considerations . . . . . . . . . . . . . . . . . . .  14
   9.  IANA Considerations . . . . . . . . . . . . . . . . . . . . .  14



Hegde, et al.            Expires August 4, 2018                 [Page 2]

Internet-Draft         OSPF graceful link shutdown          January 2018


   10. Acknowledgements  . . . . . . . . . . . . . . . . . . . . . .  14
   11. References  . . . . . . . . . . . . . . . . . . . . . . . . .  15
     11.1.  Normative References . . . . . . . . . . . . . . . . . .  15
     11.2.  Informative References . . . . . . . . . . . . . . . . .  16
   Authors' Addresses  . . . . . . . . . . . . . . . . . . . . . . .  16

1.  Introduction

   When a node is being prepared for a planned maintenance or upgrade,
   [RFC6987] provides mechanisms to advertise the node being in a
   graceful-shutdown state by setting all outgoing link costs to
   MaxLinkMetric (0xffff).  These procedures are specific to the
   maintenance activity on a node and cannot be used when a single link
   on a node requires maintenance.

   In traffic-engineering deployments, LSPs need to be diverted from the
   link without disrupting the services.  [RFC5817] describes
   requirements and procedures for graceful shutdown of MPLS links.  It
   is useful to be able to advertise the impending maintenance activity
   on the link and to have LSP re-routing policies at the ingress to
   route the LSPs away from the link.

   Many OSPFv2 or OSPFv3 deployments run on overlay networks provisioned
   by means of pseudo-wires or L2-circuits.  Prior to devices in the
   underlying network going offline for maintenance, it is useful to
   divert the traffic away from the node before the maintenance is
   actually performed.  Since the nodes in the underlying network are
   not visible to OSPF, the existing stub router mechanism described in
   [RFC6987] cannot be used.  In a service provider's network, there may
   be many CE-to-CE connections that run over a single PE.  It is
   cumbersome to change the metric on every CE-to-CE connection in both
   directions.  This document provides a mechanism to change the metric
   of the link on remote side and also use the link as a last-resort-
   link if no alternate paths are available.  An application specific to
   this use case is described in detail in Section 7.1.

   The procedures described in this draft may be used to divert the
   traffic away from the link in scenarios other than link-shutdown or
   link-replacement activity.

   This document provides mechanisms to advertise graceful-link-shutdown
   state in the flexible encodings provided by OSPFv2 Prefix/Link
   Attribute Advertisement [RFC7684] and E-Router-LSA
   [I-D.ietf-ospf-ospfv3-lsa-extend] fr OSPFv3.  Throughout this
   document, OSPF is used when the text applies to both OSPFv2 and
   OSPFv3.  OSPFv2 or OSPFv3 is used when the text is specific to one
   version of the OSPF protocol.




Hegde, et al.            Expires August 4, 2018                 [Page 3]

Internet-Draft         OSPF graceful link shutdown          January 2018


2.  Motivation

   The motivation of this document is to reduce manual intervention
   during maintenance activities.  The following objectives help to
   accomplish this in a range of deployment scenarios.

   1.  Advertise impending maintenance activity so that traffic from
       both directions can be diverted away from the link.

   2.  Allow the solution to be backward compatible so that nodes that
       do not understand the new advertisement, do not cause routing
       loops.

   3.  Advertise the maintenance activity to other nodes in the network
       so that LSP ingress routers/controllers can learn about the
       impending maintenance activity and apply specific policies to re-
       route the LSPs for traffic-engineering based deployments.

   4.  Allow the link to be used as a last resort link to prevent
       traffic disruption when alternate paths are not available.

3.  Flooding Scope

   The graceful-link-shutdown information is flooded in area-scoped
   Extended Link Opaque LSA [RFC7684] for OSPFv2 and E-Router-LSA for
   OSPFv3 [I-D.ietf-ospf-ospfv3-lsa-extend].  The Graceful-Link-Shutdown
   sub-TLV MAY be processed by the head-end nodes or the controller as
   described in the Section 7.  The procedures for processing the
   Graceful-Link-Shutdown sub-TLV are described in Section 5.

4.  Protocol Extensions

4.1.  OSPFv2 graceful-link-shutdown sub-TLV

   The Graceful-Link-Shutdown sub-TLV identifies the link as being
   gracefully shutdown.  It is advertised in extended Link TLV of the
   Extended Link Opaque LSA as defined in [RFC7684].














Hegde, et al.            Expires August 4, 2018                 [Page 4]

Internet-Draft         OSPF graceful link shutdown          January 2018


        0                   1                   2                   3
        0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1
       +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
       |              Type             |             Length            |
       +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+



            Figure 1: Graceful-Link-Shutdown sub-TLV for OSPFv2

   Type : TBA (suggested value 7)

   Length: 0



4.2.  Remote IPv4 Address Sub-TLV

   This sub-TLV specifies the IPv4 address of remote endpoint on the
   link.  It is advertised in the Extended Link TLV as defined in
   [RFC7684].  This sub-TLV is optional and MAY be advertised in an
   area-scoped Extended Link Opaque LSA to identify the link when there
   are multiple parallel links between two nodes.



        0                   1                   2                   3
        0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1
       +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
       |              Type             |             Length            |
       +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
       |                     Remote IPv4 address                       |
       +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+


                   Figure 2: Remote IPv4 Address Sub-TLV

   Type : TBA (suggested value 8)

   Length: 4

   Value: Remote IPv4 address.  The remote IPv4 address is used to
   identify the particular link on remote side when there are multiple
   parallel links between two nodes.







Hegde, et al.            Expires August 4, 2018                 [Page 5]

Internet-Draft         OSPF graceful link shutdown          January 2018


4.3.  Local/Remote Interface ID Sub-TLV

   This sub-TLV specifies local and remote interface identifiers.  It is
   advertised in the Extended Link TLV as defined in [RFC7684].  This
   sub-TLV is optional and MAY be advertised in an area-scoped Extended
   Link Opaque LSA to identify the link when there are multiple parallel
   unnumbered links between two nodes.  The local interface-id is
   generally readily available.  One of the mechanisms to obtain remote
   interface-id is described in [RFC4203].



        0                   1                   2                   3
        0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1
       +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
       |              Type             |             Length            |
       +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
       |                     Local Interface ID                        |
       +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
       |                     Remote Interface ID                       |
       +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+


                Figure 3: Local/Remote Interface ID Sub-TLV

   Type : TBA (suggested value 9)

   Length: 8

   Value: 4 octets of Local Interface ID followed by 4 octets of Remote
   interface ID.


4.4.  OSPFv3 Graceful-Link-Shutdown sub-TLV

   The Graceful-Link-Shutdown sub-TLV is carried in the Router-Link TLV
   as defined in the [I-D.ietf-ospf-ospfv3-lsa-extend] for OSPFv3.  The
   Router-Link TLV contains the neighbour interface-id and can uniquely
   identify the link on the remote node.












Hegde, et al.            Expires August 4, 2018                 [Page 6]

Internet-Draft         OSPF graceful link shutdown          January 2018


        0                   1                   2                   3
        0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1
       +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
       |              Type             |             Length            |
       +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+

            Figure 4: Graceful-Link-Shutdown sub-TLV for OSPFv3

   Type : TBA (Suggested value 7)

   Length: 0

4.5.  BGP-LS Graceful-Link-Shutdown TLV

   BGP-LS as defined in [RFC7752] is a mechanism to distribute network
   information to the external entities using BGP routing protocol.
   Graceful-link-shutdown is an imporatant link information that the
   external entities can use for various use cases as defined in
   Section 7.  BGP Link NLRI is used to carry the link information.  A
   new TLV called Graceful-Link-Shutdown is defined to describe the link
   attribute corresponding to graceful-link-shutdown state.  The TLV
   format is as described in [RFC7752] sec 3.1.  There is no value field
   and length field is set to zero for this TLV.



        0                   1                   2                   3
        0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1
       +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
       |              Type             |             Length            |
       +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+

              Figure 5: Graceful-Link-Shutdown TLV for BGP-LS

   Type : TBA (Suggested value 1121)

   Length: 0

4.6.  Distinguishing parallel links












Hegde, et al.            Expires August 4, 2018                 [Page 7]

Internet-Draft         OSPF graceful link shutdown          January 2018


       ++++++++++I.w            I.y +++++++++
       |Router A|------------------|Router B |
       |        |------------------|         |
       ++++++++++I.x             I.z++++++++++

                         Figure 6: Parallel Linkls

   Consider two routers A and B connected with two parallel point-to-
   point interfaces.  I.w and I.x represent the Interface address on
   Router A's side and I.y and I.z represent Interface addresses on
   Router B's side.  The extended link opaque LSA as described in
   [RFC7684] describes links using link-type, Link-ID and Link-data.
   For ex.  Link with address I.w is described as below on Router A.

      Link-type = Point-to-point

      Link-ID: Router-ID of B

      Link-Data = I.w

   A third node (controller or head-end) in the network cannot
   distinguish the Interface on router B which is connected to this
   particular Interface with the above information.  Interface with
   address I.y or I.z could be chosen due to this ambiguity.  In such
   cases Remote-IPv4 Address sub-TLV should be originated and added to
   the Extended Link TLV.  The use cases as described in Section 7
   require controller or head-end nodes to interpret the graceful-link-
   shutdown information and hence the need for the Remote IPv4 address
   sub-TLV.  I.y is carried in the Extended Link TLV which unambiguously
   identifies the interface on the remote side.  OSPFv3 Router-link-TLV
   as described in [I-D.ietf-ospf-ospfv3-lsa-extend] contains Interface
   ID and neighbor's Interface-ID which can uniquely identify connecting
   interface on the remote side and hence OSPFv3 does not require
   seperate Remote-IPv6 address to be advertised along with the OSPFv3-
   Graceful-Link-Shutdown sub-TLV.

5.  Elements of procedure

   As defined in [RFC7684] every link on the node will have a separate
   Extended Link Opaque LSA.  The node that has the link to be taken out
   of service MUST advertise the Graceful-Link-Shutdown sub-TLV in the
   Extended Link TLV of the Extended Link Opaque LSA as defined in
   [RFC7684] for OSPFv2 and Router-Link TLV of E-Router-LSA for OSPFv3.
   The Graceful-Link-Shutdown sub-TLV indicates that the link identified
   by the sub-TLV is subjected to maintenance.

   For the purposes of changing the metric OSPFv2 and OSPFv3 Router-LSAs
   need to be re-orignated and for Traffic Engineering metric, TE Opaque



Hegde, et al.            Expires August 4, 2018                 [Page 8]

Internet-Draft         OSPF graceful link shutdown          January 2018


   LSAs [RFC3630] in OSPFv2 and Intra-area-TE-LSA [RFC5329]in OSPFv3
   need to be re-originated.

   The Graceful-Link-Shutdown information is advertised as a property of
   the link and is flooded across the area.  This information can be
   used by ingress routers or controllers to take special actions.  An
   application specific to this use case is described in Section 7.2.

   The precise action taken by the remote node at the other end of the
   link identified for graceful-shutdown depends on the link type.

   When a link is ready to carry traffic, the Graceful-Lnk-Shutdown sub-
   TLV should be removed from the Extended Link TLV/Router-Link TLV and
   the corresponding LSAs MUST be readvertised.

5.1.  Point-to-point links

   The node that has the link to be taken out of service MUST set metric
   of the link to MaxLinkMetric (0xffff) and re-originate its router-
   LSA.  The Traffic Engineering metric of the link SHOULD be set to
   (0xffffffff) and the node SHOULD re-originate the corresponding TE
   Link Opaque LSAs.  When a Graceful-Link-Shutdown sub-TLV is received
   for a point-to-point link, the remote node MUST identify the local
   link which corresponds to the graceful-shutdown link and set its
   metric to MaxLinkMetric (0xffff) and the remote node MUST re-
   originate its router-LSA with the changed metric.  When TE is
   enabled, the Traffic Engineering metric of the link SHOULD be set to
   (0xffffffff) and the TE opaque LSA for the link SHOULD be re-
   originated with new value.Similarly, the remote node SHOULD set the
   Traffic Engineering metric of the link to 0xffffffff and SHOULD re-
   originate the TE Link Opaque LSA for the link with the new value.

   The Extended link opaque LSAs and the Extended link TLV are not
   scoped for multi-topology [RFC4915].  In multi-topology deployments
   [RFC4915], the Graceful-Link-Shutdown sub-TLV advertised in an
   Extended Link opaque LSA corresponds to all the topologies which
   include the link.  The receiver node SHOULD change the metric in the
   reverse direction for all the topologies which include the remote
   link and re-originate the router-LSA as defined in [RFC4915].

   When the originator of the Graceful-Link-Shutdown sub-TLV purges the
   Extended Link Opaque LSA or re-originates it without the Graceful-
   Link-Shutdown sub-TLV, the remote node must re-originate the
   appropriate LSAs with the metric and TE metric values set to their
   original values.






Hegde, et al.            Expires August 4, 2018                 [Page 9]

Internet-Draft         OSPF graceful link shutdown          January 2018


5.2.  Broadcast/NBMA links

   Broadcast or NBMA networks in OSPF are represented by a star topology
   where the Designated Router (DR) is the central point to which all
   other routers on the broadcast or NBMA network logically connect.  As
   a result, routers on the broadcast or NBMA network advertise only
   their adjacency to the DR.  Routers that do not act as DR do not form
   or advertise adjacencies with each other.  For the Broadcast links,
   the MaxLinkMetric on the remote link cannot be changed since all the
   neighbors are on same link.  Setting the link cost to MaxLinkMetric
   would impact paths going via all neighbors.

   The node that has the link to be taken out of service MUST set metric
   of the link to MaxLinkMetric (0xffff) and re-originate the Router-
   LSA.  The Traffic Engineering metric of the link SHOULD be set to (
   0xffffffff) and the node SHOULD re-originate the corresponding TE
   Link Opaque LSAs.  For a broadcast link, the two part metric as
   described in [RFC8042] is used.  The node originating the Graceful-
   Link-Shutdown sub-TLV MUST set the metric in the Network-to-Router
   Metric sub-TLV to MaxLinkMetric (0xffff) for OSPFv2 and OSPFv3 and
   re-originate the corresponding LSAs.  The nodes that receive the two-
   part metric should follow the procedures described in [RFC8042].  The
   backward compatibility procedures described in [RFC8042] should be
   followed to ensure loop free routing.

5.3.  Point-to-multipoint links

   Operation for the point-to-multipoint links is similar to the point-
   to-point links.  When a Graceful-Link-Shutdown sub-TLV is received
   for a point-to-multipoint link the remote node MUST identify the
   neighbour which corresponds to the graceful-shutdown link and set its
   metric to MaxLinkMetric (0xffff).  The remote node MUST re-originate
   the router-LSA with the changed metric for the correponding neighbor.

5.4.  Unnumbered interfaces

   Unnumbered interface do not have a unique IP address and borrow their
   address from other interfaces.  [RFC2328] describes procedures to
   handle unnumbered interfaces in the context of the router-LSA.  We
   apply a similar procedure to the Extended Link TLV advertising the
   Graceful-Link-Shutdown sub-TLV in order to handle unnumbered
   interfaces.  The link-data field in the Extended Link TLV includes
   the Local interface-id instead of the IP address.  The Local/Remote
   Interface ID sub-TLV MUST be advertised when there are multiple
   parallel unnumbered interfaces between two nodes.  One of the
   mechanisms to obtain the interface-id of the remote side are defined
   in [RFC4203].




Hegde, et al.            Expires August 4, 2018                [Page 10]

Internet-Draft         OSPF graceful link shutdown          January 2018


5.5.  Hybrid Broadcast and P2MP interfaces

   Hybrid Broadcast and P2MP interfaces represent a broadcast network
   modeled as P2MP interfaces.  [RFC6845] describes procedures to handle
   these interfaces.  Operation for the Hybrid interfaces is similar to
   the P2MP interfaces.  When a Graceful-Link-Shutdown sub-TLV is
   received for a hybrid link, the remote node MUST identify the
   neighbor which corresponds to the graceful-shutdown link and set its
   metric to MaxLinkMetric (0xffff).  All the remote nodes connected to
   originator MUST re-originate the router-LSA with the changed metric
   for the neighbor.

6.  Backward compatibility

   The mechanisms described in the document are fully backward
   compatible.  It is required that the node adverting the Graceful-
   Link-Shutdown sub-TLV as well as the node at the remote end of the
   graceful-shutdown link support the extensions described herein for
   the traffic to diverted from the graceful-shutdown link.  If the
   remote node doesn't support the capability, it will still use the
   graceful-shutdown link but there are no other adverse effects.  In
   the case of broadcast links using two-part metrics, the backward
   compatibility procedures as described in [RFC8042] are applicable.

7.  Applications

7.1.  Pseudowire Services

   Many service providers offer pseudo-wire services to customers using
   L2 circuits.  The IGP protocol that runs in the customer network
   would also run over the pseudo-wire to create a seamless private
   network for the customer.  Service providers want to offer graceful-
   shutdown functionality when the PE device is taken-out for
   maintenance.  The provider should guarantee that the PE is taken out
   for maintenance, only after the service is successfully diverted on
   an alternate path.  There can be large number of customers attached
   to a PE node and the remote end-points for these pseudo-wires are
   spread across the service provider's network.  It is a tedious and
   error-prone process to change the metric for all pseudo-wires in both
   directions.  The graceful-link-shutdown feature simplifies the
   process by increasing the metric on the link in the reverse direction
   as well so that traffic in both directions is diverted away from the
   PE undergoing maintenance.  The Graceful-Link-Shutdown feature allows
   the link to be used as a last resort link so that traffic is not
   disrupted when alternate paths are not available.






Hegde, et al.            Expires August 4, 2018                [Page 11]

Internet-Draft         OSPF graceful link shutdown          January 2018


                   overlay network
           =======================================
          |                                       |
          |                                       |
          |     ------PE3---------------PE4------CE3
          |   /                             \
          | /                                 \
        CE1---------PE1----------PE2---------CE2
          |                       \
          |                        \
          |                         ------CE4
          |                                 |
          |                                 |
          |                                 |
           =================================
                   overlay network


                       Figure 7: Pseudowire Services

   In the example shown in Figure 7, when the PE1 node is going out of
   service for maintenance, service providers set the PE1 to stub-router
   state.  The PE1 going in to maintenance state triggers all the CEs
   connected to the PE (CE1 in this case) to set their pseudowire links
   passing via PE1 to graceful-link-shutdown state.  The mechanisms used
   to communicate between PE1 and CE1 is outside the scope of this
   document.  CE1 sets the graceful-link-shutdown state on its links
   connecting CE3, CE2 and CE4 and changes the metric to MaxLinkMetric
   and re-originates the corresponding LSA.  The remote end of the link
   at CE3, CE2, and CE4 also set the metric on the link to MaxLinkMetric
   and the traffic from both directions gets diverted away from the
   pseudowires.

7.2.  Controller based Traffic Engineering Deployments

   In controller-based deployments where the controller participates in
   the IGP protocol, the controller can also receive the graceful-link-
   shutdown information as a warning that link maintenance is imminent.
   Using this information, the controller can find alternate paths for
   traffic which uses the affected link.  The controller can apply
   various policies and re-route the LSPs away from the link undergoing
   maintenance.  If there are no alternate paths satisfying the traffic
   engineering constraints, the controller might temporarily relax those
   constraints and put the service on a different path.  Increasing the
   link metric alone does not specify the maintenance activity as the
   metric could increase in events such as LDP-IGP synchronisation.  An
   explicit indication from the router using the graceful-link-shutdown
   sub-TLV is needed to inform the Controller or head-end routers.



Hegde, et al.            Expires August 4, 2018                [Page 12]

Internet-Draft         OSPF graceful link shutdown          January 2018


                         _____________
                        |             |
           -------------| Controller  |--------------
          |             |____________ |             |
          |                                         |
          |--------- Primary Path ------------------|
          PE1---------P1----------------P2---------PE2
                      |                  |
                      |                  |
                      |________P3________|

                         Alternate Path


              Figure 8: Controller based Traffic Engineering

   In the above example, PE1->PE2 LSP is set-up to satisfy a constraint
   of 10 Gbps bandwidth on each link.  The links P1->P3 and P3->P2 have
   only 1 Gbps capacity and there is no alternate path satisfying the
   bandwidth constraint of 10Gbps.  When P1->P2 link is being prepared
   for maintenance, the controller receives the graceful-link-shutdown
   information, as there is no alternate path available which satisfies
   the constraints, the controller chooses a path that is less optimal
   and temporarily sets up an alternate path via P1->P3->P2.  Once the
   traffic is diverted, the P1->P2 link can be taken out of service for
   maintenance/upgrade.

7.3.  L3VPN Services and sham-links

   Many service providers offer L3VPN services to customers and CE-PE
   links run OSPF [RFC4577].  When PE is taken out of service for
   maintenance, all the links on the PE can be set to graceful-link-
   shutdown state which will gurantee that the traffic to/from dual-
   homed CEs gets diverted.  The interaction between OSPF and BGP is
   outside the scope of this document.  [RFC6987] based mechanism with
   summaries and externals advertised with high metrics could also be
   used to achieve the same functionality when implementations support
   high metrics advertisement for summaries and externals.

   Another useful usecase is when ISPs provide sham-link services to
   customers [RFC4577].  When PE goes out of service for maintenance,
   all sham-links on the PE can be set to graceful-link-shutdown state
   and traffic can be divered from both ends without having to touch the
   configurations on the remote end of the sham-links.







Hegde, et al.            Expires August 4, 2018                [Page 13]

Internet-Draft         OSPF graceful link shutdown          January 2018


7.4.  Hub and spoke deployment

   OSPF is largely deployed in Hub and Spoke deployments with a large
   number of spokes connecting to the Hub. It is a general practice to
   deploy multiple Hubs with all spokes connecting to these Hubs to
   achieve redundancy.  The [RFC6987]  mechanism can be used to divert
   the spoke-to-spoke traffic from the overloaded hub router.  The
   traffic that flows from spokes via the hub into an external network
   may not be diverted in certain scenarios.When a Hub node goes down
   for maintenance, all links on the Hub can be set to graceful-link-
   shutdown state and traffic gets divered from the spoke sites as well
   without having to make configuration changes on the spokes.

8.  Security Considerations

   This document utilizes the OSPF packets and LSAs described in
   [RFC2328] , [RFC5340] , [RFC3630] and [RFC5329].  The authentication
   procedures described in [RFC2328] for OSPFv2 and [RFC4552] for OSPFv3
   are applicable to this document as well.  This document does not
   introduce any further security issues other than those discussed in
   [RFC2328] and [RFC5340].

9.  IANA Considerations

   This specification updates one OSPF registry:

   OSPFv2 Extended Link TLV Sub-TLVs

   i) Graceful-Link-Shutdown Sub-TLV - Suggested value 7

   ii) Remote IPv4 Address Sub-TLV - Suggested value 8

   iii) Local/Remote Interface ID Sub-TLV - Suggested Value 9

   OSPFv3 Extended-LSA sub-TLV Registry

   i) Graceful-Link-Shutdown sub-TLV - suggested value 7

   BGP-LS Node Descriptor, Link Descriptor, Prefix Descriptor, and
   Attribute TLVs [RFC7752]

   i)Graceful-Link-Shutdown TLV - Suggested 1121

10.  Acknowledgements

   Thanks to Chris Bowers for valuable inputs and edits to the document.
   Thanks to Jeffrey Zhang, Acee Lindem and Ketan Talaulikar for inputs.




Hegde, et al.            Expires August 4, 2018                [Page 14]

Internet-Draft         OSPF graceful link shutdown          January 2018


   Thanks to Karsten Thomann for careful review and inputs on the
   applications where graceful-link-shutdown is useful.

   Thanks to Alia atlas, Deborah Brungard, Alvaro Retana and Tim Chown
   for valuable inputs.

11.  References

11.1.  Normative References

   [I-D.ietf-ospf-ospfv3-lsa-extend]
              Lindem, A., Roy, A., Goethals, D., Vallem, V., and F.
              Baker, "OSPFv3 LSA Extendibility", draft-ietf-ospf-ospfv3-
              lsa-extend-23 (work in progress), January 2018.

   [RFC2119]  Bradner, S., "Key words for use in RFCs to Indicate
              Requirement Levels", BCP 14, RFC 2119,
              DOI 10.17487/RFC2119, March 1997,
              <https://www.rfc-editor.org/info/rfc2119>.

   [RFC2328]  Moy, J., "OSPF Version 2", STD 54, RFC 2328,
              DOI 10.17487/RFC2328, April 1998,
              <https://www.rfc-editor.org/info/rfc2328>.

   [RFC3630]  Katz, D., Kompella, K., and D. Yeung, "Traffic Engineering
              (TE) Extensions to OSPF Version 2", RFC 3630,
              DOI 10.17487/RFC3630, September 2003,
              <https://www.rfc-editor.org/info/rfc3630>.

   [RFC5329]  Ishiguro, K., Manral, V., Davey, A., and A. Lindem, Ed.,
              "Traffic Engineering Extensions to OSPF Version 3",
              RFC 5329, DOI 10.17487/RFC5329, September 2008,
              <https://www.rfc-editor.org/info/rfc5329>.

   [RFC5340]  Coltun, R., Ferguson, D., Moy, J., and A. Lindem, "OSPF
              for IPv6", RFC 5340, DOI 10.17487/RFC5340, July 2008,
              <https://www.rfc-editor.org/info/rfc5340>.

   [RFC6845]  Sheth, N., Wang, L., and J. Zhang, "OSPF Hybrid Broadcast
              and Point-to-Multipoint Interface Type", RFC 6845,
              DOI 10.17487/RFC6845, January 2013,
              <https://www.rfc-editor.org/info/rfc6845>.

   [RFC6987]  Retana, A., Nguyen, L., Zinin, A., White, R., and D.
              McPherson, "OSPF Stub Router Advertisement", RFC 6987,
              DOI 10.17487/RFC6987, September 2013,
              <https://www.rfc-editor.org/info/rfc6987>.




Hegde, et al.            Expires August 4, 2018                [Page 15]

Internet-Draft         OSPF graceful link shutdown          January 2018


   [RFC7684]  Psenak, P., Gredler, H., Shakir, R., Henderickx, W.,
              Tantsura, J., and A. Lindem, "OSPFv2 Prefix/Link Attribute
              Advertisement", RFC 7684, DOI 10.17487/RFC7684, November
              2015, <https://www.rfc-editor.org/info/rfc7684>.

   [RFC7752]  Gredler, H., Ed., Medved, J., Previdi, S., Farrel, A., and
              S. Ray, "North-Bound Distribution of Link-State and
              Traffic Engineering (TE) Information Using BGP", RFC 7752,
              DOI 10.17487/RFC7752, March 2016,
              <https://www.rfc-editor.org/info/rfc7752>.

   [RFC8042]  Zhang, Z., Wang, L., and A. Lindem, "OSPF Two-Part
              Metric", RFC 8042, DOI 10.17487/RFC8042, December 2016,
              <https://www.rfc-editor.org/info/rfc8042>.

11.2.  Informative References

   [RFC4203]  Kompella, K., Ed. and Y. Rekhter, Ed., "OSPF Extensions in
              Support of Generalized Multi-Protocol Label Switching
              (GMPLS)", RFC 4203, DOI 10.17487/RFC4203, October 2005,
              <https://www.rfc-editor.org/info/rfc4203>.

   [RFC4552]  Gupta, M. and N. Melam, "Authentication/Confidentiality
              for OSPFv3", RFC 4552, DOI 10.17487/RFC4552, June 2006,
              <https://www.rfc-editor.org/info/rfc4552>.

   [RFC4577]  Rosen, E., Psenak, P., and P. Pillay-Esnault, "OSPF as the
              Provider/Customer Edge Protocol for BGP/MPLS IP Virtual
              Private Networks (VPNs)", RFC 4577, DOI 10.17487/RFC4577,
              June 2006, <https://www.rfc-editor.org/info/rfc4577>.

   [RFC4915]  Psenak, P., Mirtorabi, S., Roy, A., Nguyen, L., and P.
              Pillay-Esnault, "Multi-Topology (MT) Routing in OSPF",
              RFC 4915, DOI 10.17487/RFC4915, June 2007,
              <https://www.rfc-editor.org/info/rfc4915>.

   [RFC5817]  Ali, Z., Vasseur, JP., Zamfir, A., and J. Newton,
              "Graceful Shutdown in MPLS and Generalized MPLS Traffic
              Engineering Networks", RFC 5817, DOI 10.17487/RFC5817,
              April 2010, <https://www.rfc-editor.org/info/rfc5817>.

Authors' Addresses









Hegde, et al.            Expires August 4, 2018                [Page 16]

Internet-Draft         OSPF graceful link shutdown          January 2018


   Shraddha Hegde
   Juniper Networks, Inc.
   Embassy Business Park
   Bangalore, KA  560093
   India

   Email: shraddha@juniper.net


   Pushpasis Sarkar
   Arrcus, Inc.

   Email: pushpasis.ietf@gmail.com


   Hannes Gredler
   Individual

   Email: hannes@gredler.at


   Mohan Nanduri
   ebay Corporation
   2025 Hamilton Avenue
   San Jose, CA  98052
   US

   Email: mnanduri@ebay.com


   Luay Jalil
   Verizon

   Email: luay.jalil@verizon.com

















Hegde, et al.            Expires August 4, 2018                [Page 17]
